Revit 2027 API
Dimension.DimensionType Property
 The dimension style of this dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DimensionType DimensionType { get; set; }
Public Property DimensionType As DimensionType
	Get
	Set
public:
property DimensionType^ DimensionType {
	DimensionType^ get ();
	void set (DimensionType^ value);
}
member DimensionType : DimensionType with get, set
Property Value
DimensionType
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace